Here are deploy logs..  Tried to attach as file but not option in this forum.... 

`
Running with gitlab-runner 17.4.0 (b92ee590)
  on dash-gitlab-runner-hpe02-01 t2_bfeo96, system ID: s_842bd694053e
Resolving secrets
Preparing the "docker" executor
00:02
Using Docker executor with image ghcr.io/opentofu/opentofu:1.8.3 ...
Pulling docker image ghcr.io/opentofu/opentofu:1.8.3 ...
Using docker image sha256:3cfd8c24f97d891cbcc7f3ce8ee1ee4dadb4f070bbf5e52aab20e46d412846b8 for ghcr.io/opentofu/opentofu:1.8.3 with digest ghcr.io/opentofu/opentofu@sha256:f7c3d7c7e0ba6c06ec306328d31729f2033d8c305dc02ba8cf096f0aa01de157 ...
Preparing environment
00:00
Running on runner-t2bfeo96-project-61962447-concurrent-0 via dash-gitlab-runner-hpe02-01...
Getting source from Git repository
00:02
Fetching changes with git depth set to 20...
Reinitialized existing Git repository in /builds/ignw1/internal/labs/presales-lab/applicationmodernization/rancher_deploy/.git/
Checking out 5c052daf as detached HEAD (ref is main)...
Removing .secure_files/
Skipping Git submodules setup
Executing "step_script" stage of the job script
02:56
Using docker image sha256:3cfd8c24f97d891cbcc7f3ce8ee1ee4dadb4f070bbf5e52aab20e46d412846b8 for ghcr.io/opentofu/opentofu:1.8.3 with digest ghcr.io/opentofu/opentofu@sha256:f7c3d7c7e0ba6c06ec306328d31729f2033d8c305dc02ba8cf096f0aa01de157 ...
$ apk add curl
fetch https://dl-cdn.alpinelinux.org/alpine/v3.18/main/x86_64/APKINDEX.tar.gz
fetch https://dl-cdn.alpinelinux.org/alpine/v3.18/community/x86_64/APKINDEX.tar.gz
(1/3) Installing libpsl (0.21.5-r0)
(2/3) Upgrading libcurl (8.9.1-r1 -> 8.11.1-r0)
(3/3) Installing curl (8.11.1-r0)
Executing busybox-1.36.1-r7.trigger
OK: 26 MiB in 38 packages
$ apk add ansible
(1/42) Installing libbz2 (1.0.8-r5)
(2/42) Installing libffi (3.4.4-r2)
(3/42) Installing gdbm (1.23-r1)
(4/42) Installing xz-libs (5.4.3-r0)
(5/42) Installing libgcc (12.2.1_git20220924-r10)
(6/42) Installing libstdc++ (12.2.1_git20220924-r10)
(7/42) Installing mpdecimal (2.5.1-r2)
(8/42) Installing libpanelw (6.4_p20230506-r0)
(9/42) Installing sqlite-libs (3.41.2-r3)
(10/42) Installing python3 (3.11.11-r0)
(11/42) Installing python3-pycache-pyc0 (3.11.11-r0)
(12/42) Installing pyc (0.1-r0)
(13/42) Installing py3-cparser (2.21-r2)
(14/42) Installing py3-cparser-pyc (2.21-r2)
(15/42) Installing py3-cffi (1.15.1-r3)
(16/42) Installing py3-cffi-pyc (1.15.1-r3)
(17/42) Installing py3-cryptography (41.0.3-r0)
(18/42) Installing py3-cryptography-pyc (41.0.3-r0)
(19/42) Installing py3-markupsafe (2.1.2-r1)
(20/42) Installing py3-markupsafe-pyc (2.1.2-r1)
(21/42) Installing py3-jinja2 (3.1.5-r0)
(22/42) Installing py3-jinja2-pyc (3.1.5-r0)
(23/42) Installing py3-parsing (3.0.9-r2)
(24/42) Installing py3-parsing-pyc (3.0.9-r2)
(25/42) Installing py3-packaging (23.1-r1)
(26/42) Installing py3-packaging-pyc (23.1-r1)
(27/42) Installing py3-bcrypt (4.0.1-r2)
(28/42) Installing py3-bcrypt-pyc (4.0.1-r2)
(29/42) Installing py3-pynacl (1.5.0-r4)
(30/42) Installing py3-pynacl-pyc (1.5.0-r4)
(31/42) Installing py3-paramiko (3.1.0-r1)
(32/42) Installing py3-paramiko-pyc (3.1.0-r1)
(33/42) Installing py3-resolvelib (1.0.1-r0)
(34/42) Installing py3-resolvelib-pyc (1.0.1-r0)
(35/42) Installing yaml (0.2.5-r1)
(36/42) Installing py3-yaml (6.0-r3)
(37/42) Installing py3-yaml-pyc (6.0-r3)
(38/42) Installing ansible-core (2.14.5-r0)
(39/42) Installing ansible-core-pyc (2.14.5-r0)
(40/42) Installing ansible-pyc (7.5.0-r0)
(41/42) Installing python3-pyc (3.11.11-r0)
(42/42) Installing ansible (7.5.0-r0)
Executing busybox-1.36.1-r7.trigger
OK: 521 MiB in 80 packages
$ apk add helm
(1/1) Installing helm (3.11.3-r4)
Executing busybox-1.36.1-r7.trigger
OK: 571 MiB in 81 packages
$ curl --silent "https://gitlab.com/gitlab-org/incubation-engineering/mobile-devops/download-secure-files/-/raw/main/installer" | bash
Downloading download-secure-files from https://gitlab.com/gitlab-org/incubation-engineering/mobile-devops/download-secure-files/-/releases/permalink/latest/downloads/download-secure-files-linux-amd64
Installing download-secure-files at /usr/bin/download-secure-files
Downloading Secure Files (v0.1.12) to /builds/ignw1/internal/labs/presales-lab/applicationmodernization/rancher_deploy/.secure_files
user-data.txt downloaded to .secure_files/user-data.txt
$ export TF_HTTP_ADDRESS="${TF_HTTP_ADDRESS:-${CI_API_V4_URL}/projects/${CI_PROJECT_ID}/terraform/state/rke-lz2-sc}"
$ export TF_HTTP_LOCK_ADDRESS="${TF_HTTP_LOCK_ADDRESS:-${TF_HTTP_ADDRESS}/lock}"
$ export TF_HTTP_UNLOCK_ADDRESS="${TF_HTTP_UNLOCK_ADDRESS:-${TF_HTTP_ADDRESS}/lock}"
$ apk add wget git unzip
(1/2) Installing unzip (6.0-r14)
(2/2) Installing wget (1.21.4-r0)
Executing busybox-1.36.1-r7.trigger
OK: 572 MiB in 83 packages
$ update-ca-certificates --fresh
$ git config --global http.sslVerify false
$ which ssh-agent || ( apk add openssh-client )
/usr/bin/ssh-agent
$ eval $(ssh-agent -s)
Agent pid 51
$ echo "$CLUSTER_SSH_KEY_PRIV" | tr -d '\r' | ssh-add -
Identity added: (stdin) (jerewis@LT-A007051l)
$ cd environments/dv_eng_dash_cdwbuilt_com/rke-lz2-sc
$ tofu init
Initializing the backend...
Successfully configured the backend "http"! OpenTofu will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- rancher_vm_deploy in ../../../modules/rancher_vm_deploy
Initializing provider plugins...
- Finding hashicorp/vsphere versions matching "2.10.0"...
- Installing hashicorp/vsphere v2.10.0...
- Installed hashicorp/vsphere v2.10.0 (signed, key ID 0C0AF313E5FD9F80)
Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/
OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.
OpenTofu has been successfully initialized!
$ tofu plan
module.rancher_vm_deploy.data.vsphere_datacenter.datacenter: Reading...
module.rancher_vm_deploy.data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
module.rancher_vm_deploy.data.vsphere_resource_pool.pool: Reading...
module.rancher_vm_deploy.data.vsphere_network.network: Reading...
module.rancher_vm_deploy.data.vsphere_virtual_machine.tmpl-sles15: Reading...
module.rancher_vm_deploy.data.vsphere_compute_cluster.cluster: Reading...
module.rancher_vm_deploy.data.vsphere_datastore.datastore: Reading...
module.rancher_vm_deploy.data.vsphere_network.network: Read complete after 0s [id=dvportgroup-14035]
module.rancher_vm_deploy.data.vsphere_datastore.datastore: Read complete after 0s [id=datastore-11168]
module.rancher_vm_deploy.data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c11073]
module.rancher_vm_deploy.data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-11163]
module.rancher_vm_deploy.data.vsphere_virtual_machine.tmpl-sles15: Read complete after 0s [id=420ba3dd-202b-9b10-7ef1-7ba1ab6fc66b]
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
OpenTofu will perform the following actions:
  # module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0] will be created
  + resource "vsphere_virtual_machine" "lz1-sc" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11168"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = (known after apply)
      + extra_config_reboot_required            = true
      + firmware                                = "bios"
      + folder                                  = (sensitive value)
      + force_power_off                         = true
      + guest_id                                = "sles15_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = (known after apply)
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 16384
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = (sensitive value)
      + num_cores_per_socket                    = 1
      + num_cpus                                = 4
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-11163"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = [
          + "com.vmware.guestInfo",
        ]
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5
      + clone {
          + template_uuid = "420ba3dd-202b-9b10-7ef1-7ba1ab6fc66b"
          + timeout       = 30
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "os0"
          + path              = (known after apply)
          + size              = 120
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-14035"
        }
      + vapp {
          + properties = {
              + "local-hostname" = (sensitive value)
              + "network-config" = (sensitive value)
              + "user-data"      = "I2Nsb3VkLWNvbmZpZw0KI3Bhc3N3b3JkOkNEV0AxbGFiDQp1c2VyczoNCiAgLSBkZWZhdWx0DQogIC0gbmFtZTogYW5zaWJsZQ0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZ2g6ZmFuY3l0eXBob29ua2l0dHkNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwNCiAgLSBuYW1lOiBhZG1pbg0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEw="
            }
        }
    }
  # module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1] will be created
  + resource "vsphere_virtual_machine" "lz1-sc" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11168"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = (known after apply)
      + extra_config_reboot_required            = true
      + firmware                                = "bios"
      + folder                                  = (sensitive value)
      + force_power_off                         = true
      + guest_id                                = "sles15_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = (known after apply)
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 16384
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = (sensitive value)
      + num_cores_per_socket                    = 1
      + num_cpus                                = 4
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-11163"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = [
          + "com.vmware.guestInfo",
        ]
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5
      + clone {
          + template_uuid = "420ba3dd-202b-9b10-7ef1-7ba1ab6fc66b"
          + timeout       = 30
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "os0"
          + path              = (known after apply)
          + size              = 120
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-14035"
        }
      + vapp {
          + properties = {
              + "local-hostname" = (sensitive value)
              + "network-config" = (sensitive value)
              + "user-data"      = "I2Nsb3VkLWNvbmZpZw0KI3Bhc3N3b3JkOkNEV0AxbGFiDQp1c2VyczoNCiAgLSBkZWZhdWx0DQogIC0gbmFtZTogYW5zaWJsZQ0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZ2g6ZmFuY3l0eXBob29ua2l0dHkNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwNCiAgLSBuYW1lOiBhZG1pbg0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEw="
            }
        }
    }
  # module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2] will be created
  + resource "vsphere_virtual_machine" "lz1-sc" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11168"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = (known after apply)
      + extra_config_reboot_required            = true
      + firmware                                = "bios"
      + folder                                  = (sensitive value)
      + force_power_off                         = true
      + guest_id                                = "sles15_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = (known after apply)
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 16384
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = (sensitive value)
      + num_cores_per_socket                    = 1
      + num_cpus                                = 4
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-11163"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = [
          + "com.vmware.guestInfo",
        ]
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5
      + clone {
          + template_uuid = "420ba3dd-202b-9b10-7ef1-7ba1ab6fc66b"
          + timeout       = 30
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "os0"
          + path              = (known after apply)
          + size              = 120
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-14035"
        }
      + vapp {
          + properties = {
              + "local-hostname" = (sensitive value)
              + "network-config" = (sensitive value)
              + "user-data"      = "I2Nsb3VkLWNvbmZpZw0KI3Bhc3N3b3JkOkNEV0AxbGFiDQp1c2VyczoNCiAgLSBkZWZhdWx0DQogIC0gbmFtZTogYW5zaWJsZQ0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZ2g6ZmFuY3l0eXBob29ua2l0dHkNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwNCiAgLSBuYW1lOiBhZG1pbg0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEw="
            }
        }
    }
Plan: 3 to add, 0 to change, 0 to destroy.
$ tofu apply -auto-approve
module.rancher_vm_deploy.data.vsphere_datacenter.datacenter: Reading...
module.rancher_vm_deploy.data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
module.rancher_vm_deploy.data.vsphere_datastore.datastore: Reading...
module.rancher_vm_deploy.data.vsphere_virtual_machine.tmpl-sles15: Reading...
module.rancher_vm_deploy.data.vsphere_network.network: Reading...
module.rancher_vm_deploy.data.vsphere_resource_pool.pool: Reading...
module.rancher_vm_deploy.data.vsphere_compute_cluster.cluster: Reading...
module.rancher_vm_deploy.data.vsphere_network.network: Read complete after 0s [id=dvportgroup-14035]
module.rancher_vm_deploy.data.vsphere_datastore.datastore: Read complete after 0s [id=datastore-11168]
module.rancher_vm_deploy.data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c11073]
module.rancher_vm_deploy.data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-11163]
module.rancher_vm_deploy.data.vsphere_virtual_machine.tmpl-sles15: Read complete after 0s [id=420ba3dd-202b-9b10-7ef1-7ba1ab6fc66b]
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
OpenTofu will perform the following actions:
  # module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0] will be created
  + resource "vsphere_virtual_machine" "lz1-sc" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11168"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = (known after apply)
      + extra_config_reboot_required            = true
      + firmware                                = "bios"
      + folder                                  = (sensitive value)
      + force_power_off                         = true
      + guest_id                                = "sles15_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = (known after apply)
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 16384
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = (sensitive value)
      + num_cores_per_socket                    = 1
      + num_cpus                                = 4
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-11163"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = [
          + "com.vmware.guestInfo",
        ]
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5
      + clone {
          + template_uuid = "420ba3dd-202b-9b10-7ef1-7ba1ab6fc66b"
          + timeout       = 30
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "os0"
          + path              = (known after apply)
          + size              = 120
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-14035"
        }
      + vapp {
          + properties = {
              + "local-hostname" = (sensitive value)
              + "network-config" = (sensitive value)
              + "user-data"      = "I2Nsb3VkLWNvbmZpZw0KI3Bhc3N3b3JkOkNEV0AxbGFiDQp1c2VyczoNCiAgLSBkZWZhdWx0DQogIC0gbmFtZTogYW5zaWJsZQ0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZ2g6ZmFuY3l0eXBob29ua2l0dHkNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwNCiAgLSBuYW1lOiBhZG1pbg0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEw="
            }
        }
    }
  # module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1] will be created
  + resource "vsphere_virtual_machine" "lz1-sc" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11168"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = (known after apply)
      + extra_config_reboot_required            = true
      + firmware                                = "bios"
      + folder                                  = (sensitive value)
      + force_power_off                         = true
      + guest_id                                = "sles15_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = (known after apply)
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 16384
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = (sensitive value)
      + num_cores_per_socket                    = 1
      + num_cpus                                = 4
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-11163"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = [
          + "com.vmware.guestInfo",
        ]
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5
      + clone {
          + template_uuid = "420ba3dd-202b-9b10-7ef1-7ba1ab6fc66b"
          + timeout       = 30
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "os0"
          + path              = (known after apply)
          + size              = 120
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-14035"
        }
      + vapp {
          + properties = {
              + "local-hostname" = (sensitive value)
              + "network-config" = (sensitive value)
              + "user-data"      = "I2Nsb3VkLWNvbmZpZw0KI3Bhc3N3b3JkOkNEV0AxbGFiDQp1c2VyczoNCiAgLSBkZWZhdWx0DQogIC0gbmFtZTogYW5zaWJsZQ0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZ2g6ZmFuY3l0eXBob29ua2l0dHkNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwNCiAgLSBuYW1lOiBhZG1pbg0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEw="
            }
        }
    }
  # module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2] will be created
  + resource "vsphere_virtual_machine" "lz1-sc" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11168"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = (known after apply)
      + extra_config_reboot_required            = true
      + firmware                                = "bios"
      + folder                                  = (sensitive value)
      + force_power_off                         = true
      + guest_id                                = "sles15_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = (known after apply)
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 16384
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = (sensitive value)
      + num_cores_per_socket                    = 1
      + num_cpus                                = 4
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-11163"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = [
          + "com.vmware.guestInfo",
        ]
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5
      + clone {
          + template_uuid = "420ba3dd-202b-9b10-7ef1-7ba1ab6fc66b"
          + timeout       = 30
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "os0"
          + path              = (known after apply)
          + size              = 120
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-14035"
        }
      + vapp {
          + properties = {
              + "local-hostname" = (sensitive value)
              + "network-config" = (sensitive value)
              + "user-data"      = "I2Nsb3VkLWNvbmZpZw0KI3Bhc3N3b3JkOkNEV0AxbGFiDQp1c2VyczoNCiAgLSBkZWZhdWx0DQogIC0gbmFtZTogYW5zaWJsZQ0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZ2g6ZmFuY3l0eXBob29ua2l0dHkNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwNCiAgLSBuYW1lOiBhZG1pbg0KICAgIGdyb3VwczoNCiAgICAgIC0gYWRtDQogICAgICAtIHdoZWVsDQogICAgbG9ja19wYXNzd2Q6IGZhbHNlDQogICAgcGFzc3dkOiAkeSRqOVQkRE1SdTBjMlBYODZkeDZ3MzJraHdPMCRndEZmdVNwWFdxcTZlem10U1A0Z01PUWFnTnVFQVFoODhiTFJHb3cvbUcxDQogICAgc3NoX2F1dGhvcml6ZWRfa2V5czoNCiAgICAgIC0gZWNkc2Etc2hhMi1uaXN0cDI1NiBBQUFBRTJWalpITmhMWE5vWVRJdGJtbHpkSEF5TlRZQUFBQUlibWx6ZEhBeU5UWUFBQUJCQks1WXk2MFZzZ28yN2FqWUFreUpHdjBFUDdkTVhHSkNrdlNKcmh1eW44MTVPK0xIc0NTTW5qTFRqekUwWmZTdzdnbzFVc2pJajJUbHd6UzBUaElYdmRJPSB0ZWNAY2R3bGFicw0KICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEw="
            }
        }
    }
Plan: 3 to add, 0 to change, 0 to destroy.
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Creating...
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Creating...
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Creating...
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [30s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [30s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [30s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [40s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [40s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [40s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [50s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [50s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [50s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [1m0s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [1m0s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [1m0s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [1m10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [1m10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [1m10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [1m20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [1m20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [1m20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [1m30s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [1m30s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [1m30s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [1m40s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [1m40s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [1m40s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [1m50s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [1m50s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [1m50s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [2m0s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [2m0s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [2m0s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [2m10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [2m10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [2m10s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Still creating... [2m20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Still creating... [2m20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Still creating... [2m20s elapsed]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[0]: Creation complete after 2m22s [id=420bd970-2101-be6f-a167-a5780b562162]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[1]: Creation complete after 2m22s [id=420baa2f-90b5-d10f-638d-381f30a2eb82]
module.rancher_vm_deploy.vsphere_virtual_machine.lz1-sc[2]: Creation complete after 2m25s [id=420b4e3b-626d-6d1c-506b-f17f4ffadac3]
Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
$ ansible-galaxy collection install git+https://github.com/rancherfederal/rke2-ansible.git,main
Cloning into '/root/.ansible/tmp/ansible-local-169p6qi_5i4/tmplqg0vjke/rke2-ansiblec4bulrsd'...
Already on 'main'
Your branch is up to date with 'origin/main'.
Starting galaxy collection install process
Process install dependency map
Starting collection install process
Installing 'rancherfederal.rke2_ansible:2.0.0' to '/root/.ansible/collections/ansible_collections/rancherfederal/rke2_ansible'
Created collection for rancherfederal.rke2_ansible:2.0.0 at /root/.ansible/collections/ansible_collections/rancherfederal/rke2_ansible
rancherfederal.rke2_ansible:2.0.0 was installed successfully
$ ansible-playbook ../../../rke-deploy-playbook.yml  -i hosts.yml
[WARNING]: Collection rancherfederal.rke2_ansible does not support Ansible
version 2.14.5
PLAY [RKE2 play] ***************************************************************
TASK [Gathering Facts] *********************************************************
fatal: [rke-lz2-sc-01.dv.acme.com]: UNREACHABLE! => {"changed": false, "msg": "Failed to connect to the host via ssh: ssh: connect to host rke-lz2-sc-01.dv.acme.com port 22: Operation timed out", "unreachable": true}
fatal: [rke-lz2-sc-02.dv.acme.com]: UNREACHABLE! => {"changed": false, "msg": "Failed to connect to the host via ssh: ssh: connect to host rke-lz2-sc-02.dv.acme.com port 22: Operation timed out", "unreachable": true}
fatal: [rke-lz2-sc-03.dv.acme.com]: UNREACHABLE! => {"changed": false, "msg": "Failed to connect to the host via ssh: ssh: connect to host rke-lz2-sc-03.dv.acme.com port 22: Operation timed out", "unreachable": true}
NO MORE HOSTS LEFT *************************************************************
PLAY RECAP *********************************************************************
rke-lz2-sc-01.dv.acme.com : ok=0    changed=0    unreachable=1    failed=0    skipped=0    rescued=0    ignored=0   
rke-lz2-sc-02.dv.acme.com : ok=0    changed=0    unreachable=1    failed=0    skipped=0    rescued=0    ignored=0   
rke-lz2-sc-03.dv.acme.com : ok=0    changed=0    unreachable=1    failed=0    skipped=0    rescued=0    ignored=0   
Uploading artifacts for failed job
00:00
Uploading artifacts...
WARNING: ~/rke-lz2-sc.yml: no matching files. Ensure that the artifact path is relative to the working directory (/builds/ignw1/internal/labs/presales-lab/applicationmodernization/rancher_deploy) 
ERROR: No files to upload                          
Cleaning up project directory and file based variables
00:01
ERROR: Job failed: exit code 1

`